# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\simon\OneDrive\Documents\PSoC Creator\FinalProject\KeysToNote.cydsn\KeysToNote.cyprj
# Date: Mon, 13 May 2024 18:20:10 GMT
#set_units -time ns
create_clock -name {Wave_Out_IntClock(routed)} -period 4000 -waveform {0 2000} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {Wave_Out_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 97 193} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 80001 160001} -nominal_period 3333333.333333333 [list [get_pins {ClockBlock/dclk_glb_1}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Users\simon\OneDrive\Documents\PSoC Creator\FinalProject\KeysToNote.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\simon\OneDrive\Documents\PSoC Creator\FinalProject\KeysToNote.cydsn\KeysToNote.cyprj
# Date: Mon, 13 May 2024 18:20:05 GMT
